## Staging: ssm
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                     NAME                     |
|--------|----------------------------------------------|
| add    | `aws_ssm_parameter.canada_ca_search_api_key` |
|        | `aws_ssm_parameter.canada_ca_search_uri`     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ssm_parameter.canada_ca_search_api_key will be created
  + resource "aws_ssm_parameter" "canada_ca_search_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "canada_ca_search_api_key"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.canada_ca_search_uri will be created
  + resource "aws_ssm_parameter" "canada_ca_search_uri" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "canada_ca_search_uri"
      + tags_all       = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + canada_ca_search_api_key_arn = (known after apply)
  + canada_ca_search_uri_arn     = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_api_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.azure_openai_endpoint"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.canada_ca_search_api_key"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.canada_ca_search_uri"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
